#ifndef _PY_MB_H_
#define _PY_MB_H_
#include "pyinput.h"
//////////////////////////////////////////////////////////////////////////////////	 
//±¾³ÌĞòÖ»¹©Ñ§Ï°Ê¹ÓÃ£¬Î´¾­×÷ÕßĞí¿É£¬²»µÃÓÃÓÚÆäËüÈÎºÎÓÃÍ¾
//ALIENTEK STM32F407¿ª·¢°å
//Æ´ÒôÊäÈë·¨ ´úÂë	   
//ÕıµãÔ­×Ó@ALIENTEK
//¼¼ÊõÂÛÌ³:www.openedv.com
//´´½¨ÈÕÆÚ:2014/7/20
//°æ±¾£ºV1.0
//°æÈ¨ËùÓĞ£¬µÁ°æ±Ø¾¿¡£
//Copyright(C) ¹ãÖİÊĞĞÇÒíµç×Ó¿Æ¼¼ÓĞÏŞ¹«Ë¾ 2009-2019
//All rights reserved									  
//*******************************************************************************
//ĞŞ¸ÄĞÅÏ¢
//ÎŞ
////////////////////////////////////////////////////////////////////////////////// 	 
//ºº×ÖÅÅÁĞ±í
const u8 PY_mb_space []={" "};
const u8 PY_mb_a     []={"°¡°¢ëçß¹ï¹…àÄåHºÇëç"};
const u8 PY_mb_ai    []={"°®°£°¤°¥°¦°§°¨°©°ª°«°¬°­°¯ŞßàÈàÉæÈè¨êÓíÁïÍö°"};
const u8 PY_mb_an    []={"°²°³°´°µ°¶°¸°°°±ÚÏ°·ÛûŞîáíâÖèñï§ğÆ÷ö"};
const u8 PY_mb_ang   []={"°º°»°¹óa"};
const u8 PY_mb_ao    []={"°¼°½°¾°¿°À°Á°Â°Ã°ÄÛêŞÖà»òüöË÷¡÷éá®âÚåÛæÁæñéáñú"};
const u8 PY_mb_ba    []={"°Ë°Í°Ö°Î°Å°Æ°Ç°È°É°Ê°Ì°Ï°Ğ°Ñ°Ò°Ó°Ô°ÕÜØİÃá±å±îÙôÎöÑ÷É"};
const u8 PY_mb_bai   []={"°×°Ø°Ù°Ú°Û°Ü°İ°Ş²®Şãêş"};
const u8 PY_mb_ban   []={"°ë°ì°ß°à°á°â°ã°ä°å°æ°ç°è°é°ê°íÚæÛàêÚîÓñ£ñ­ô²"};
const u8 PY_mb_bang  []={"°î°ï°ğ°ñ°ò°ó°ô°õ°ö°÷°ø°ùİòäº"};
const u8 PY_mb_bao   []={"°ü±¦±£±§±¨±©°ú°û°ı°ş±¡±¢±¤±¥±ª±«±¬ÅÙÅÚÙèİáæßìÒğ±ñÙõÀöµ"};
const u8 PY_mb_bei   []={"±³±´±±±¶±­±®±¯±°±²±µ±·±¸±¹±º±»±ÛØÃÚéÚıÛıİÉİíßÂã£íÕğÇñØöÍ÷¹"};;
const u8 PY_mb_ben   []={"±¾±¿±¼±½ÛÎÛĞêÚï¼"};
const u8 PY_mb_beng  []={"°ö±À±Á±Â±Ã±Ä±ÅÜ¡àÔê´"};
const u8 PY_mb_bi    []={"±Æ±Ç±È±É±Ê±Ë±Ì±Í±Î±Ï±Ğ±Ñ±Ò±Ó±Ô±ÕØ°±Ö±×±Ø±Ù±Ú±Û±Ü±İÃØÃÚÙÂÛıÜÅÜêİ©İÉŞµßÁßÙáùâØã¹ääå¨åöåşæ¾æÔèµêÚî¯îéïõñÔóÙóëó÷ô°ôÅõÏ÷Â"};
const u8 PY_mb_bian  []={"±ß±à±á±ã±ä±å±Ş±â±æ±ç±è±éØÒÛÍÜĞâíãêçÂìÔí¾íÜñ¹ñÛòùóÖöı"};
const u8 PY_mb_biao  []={"±í±ê±ë±ìæ»æôè¼ì©ì­ì®ïÚïğñ¦ñÑ÷§÷Ô"};
const u8 PY_mb_bie   []={"±ğ±î±ï±ñõ¿"};
const u8 PY_mb_bin   []={"±ò±ó±ô±õ±ö±÷ÙÏáÙçÍçãéÄéëë÷ïÙ÷Æ÷Ş"};
const u8 PY_mb_bing  []={"±ø±ù±ú±û±ü±ı±ş²¡²¢ÆÁÙ÷ÙûÚûŞğéÄ"};
const u8 PY_mb_bo    []={"°Ø°Ù°ş±¡²©²£²¤²·²¥²¦²§²¨²ª²«²¬²­²®²¯²°²±²²²³²´²µØÃÙñŞ¬à£âÄéŞë¢íçîàğ¾ô¤õÀõËõÛ"};
const u8 PY_mb_bu    []={"²»²¼²½±¤²¶²·²¸²¹²º²¾²¿²ÀÆÒß²åÍê³êÎîĞîßõ³"};
const u8 PY_mb_ca    []={"²Áàêíå"};
const u8 PY_mb_cai   []={"²Å²Æ²Ç²Â²Ã²Ä²È²É²Ê²Ë²Ì"};
const u8 PY_mb_can   []={"²Í²Î²Ï²Ğ²Ñ²Ò²Óåîæîè²ôÓ÷õ"};
const u8 PY_mb_cang  []={"²Ô²Õ²Ö²×²ØØ÷"};
const u8 PY_mb_cao   []={"²İ²Ù²Ú²Û²ÜÜ³àĞäîó©ô½"};
const u8 PY_mb_ce    []={"²à²á²â²Ş²ßâü"};
const u8 PY_mb_cen   []={"²Îá¯ä¹"};
const u8 PY_mb_ceng  []={"²ã²äÔøàá"};
const u8 PY_mb_cha   []={"²å²æ²ç²è²é²ê²ë²ì²í²î²ïÉ²ÔûñÃàêâªâÇãâæ±è¾é«é¶éßïÊïï"};
const u8 PY_mb_chai  []={"²î²ğ²ñ²òÙ­îÎğûò²ö·"};
const u8 PY_mb_chan  []={"²ú²û²ü²ó²ô²õ²ö²÷²ø²ùåîµ¥ÙæÚÆİÛâÜâãäıå¤åñæ¿êèìøïâó¸õğ"};
const u8 PY_mb_chang []={"³¤³§²ı²ş³¡³¢³£³¥³¦³¨³©³ª³«ØöÛËÜÉİÅáäâêã®ãÑæ½æÏêÆë©öğ"};
const u8 PY_mb_chao  []={"³¬³­³®³¯³°³±³²³³³´´Â½Ëâ÷êËñé"};
const u8 PY_mb_che   []={"³µ³¶³·³¸³¹³ºÛååøíº"};
const u8 PY_mb_chen  []={"³»³¼³½³¾³¿³À³Á³Â³Ã³Ä³ÆÚÈÚßŞÓàÁå·è¡é´í×ö³"};
const u8 PY_mb_cheng []={"³Å³Æ³Ç³È³É³Ê³Ë³Ì³Í³Î³Ï³Ğ³Ñ³Ò³ÓÊ¢Ø©ÛôàááçèÇèßëóîªîñîõñÎòÉõ¨"};
const u8 PY_mb_chi   []={"³Ô³Õ³Ö³×³Ø³Ù³Ú³Û³Ü³İ³Ş³ß³à³á³â³ãó×ß³ßêÙÑÛæÜ¯Üİà´àÍáÜâÁæÊë·í÷ğ·ñ¡ñİò¿ó¤óøôùõØ÷Î"};
const u8 PY_mb_chong []={"³ä³å³æ³ç³èÖÖÖØÜûâçã¿ï¥ô©ô¾öÅ"};
const u8 PY_mb_chou  []={"³é³ê³ó³ë³ì³í³î³ï³ğ³ñ³ò³ôÙ±àüã°ñ¬öÅ"};
const u8 PY_mb_chu   []={"³ö³õ³÷³ø³ù³ú³û³ü³ı³ş´¡´¢´£´¤´¥´¦ĞóØ¡Û»âğãÀç©èÆèúéËñÒòÜõé÷í"};
const u8 PY_mb_chuai []={"´§ŞõàÜëúõß"};
const u8 PY_mb_chuan []={"´¨´©´ª´«´¬´­´®â¶å×çİë°îËô­"};
const u8 PY_mb_chuang[]={"´¯´°´±´²´³´´âëğÚ"};
const u8 PY_mb_chui  []={"´µ´¶´·´¸´¹Úïé¢é³"};
const u8 PY_mb_chun  []={"´º´»´¼´½´¾´¿´Àİ»ğÈòí"};
const u8 PY_mb_chuo  []={"´Á´Âà¨åÁê¡õÖöº"};
const u8 PY_mb_ci    []={"´Ë´Ì´Í´ÎËÅ²î´Ã´Ä´Å´Æ´Ç´È´É´Ê×ÈÜëßÚìôğËôÒôÙ"};
const u8 PY_mb_cong  []={"´Ó´Ô´Ï´Ğ´Ñ´ÒÜÊäÈæõçıè®èÈ"};
const u8 PY_mb_cou   []={"´Õé¨ê£ëí"};
const u8 PY_mb_cu    []={"´Ö´×´Ø´ÙİıáŞâ§éãõ¡õ¾õí"};
const u8 PY_mb_cuan  []={"´Ú´Û´ÜÔÜÙàß¥ìàïé"};
const u8 PY_mb_cui   []={"´İ´Ş´ß´à´á´â´ã´äİÍßıã²è­éÁë¥ö¿"};
const u8 PY_mb_cun   []={"´å´æ´çââñå"};
const u8 PY_mb_cuo   []={"´è´é´ê´ë´ì´íØÈáÏëâï±ïóğîğûõºõãõò"};
const u8 PY_mb_da    []={"´ó´î´ï´ğ´ñ´òŞÇßÕàªâòæ§í³ğãñ×óÎ÷°÷²"};
const u8 PY_mb_dai   []={"´ó´ô´õ´ö´÷´ø´ù´ú´û´ü´ı´şµ¡÷ìÜ¤ß°ß¾á·åÊææçªçé"};
const u8 PY_mb_dan   []={"µ¢µ£µ¤µ¥µ¦µ§µ¨µ©µªµ«µ¬µ­µ®µ¯µ°ÉÄÊ¯ÙÙİÌà¢å£ééêæíñğãğ÷ñõóì"};
const u8 PY_mb_dang  []={"µ±µ²µ³µ´µµÚÔÛÊİĞå´í¸îõñÉ"};
const u8 PY_mb_dao   []={"µ¶µ·µ¸µ¹µºµ»µ¼µ½µ¾µ¿µÀµÁØÖß¶àüâáë®ìâôî"};
const u8 PY_mb_de    []={"µÂµÃµÄµØï½"};
const u8 PY_mb_dei   []={"µÃ"};
const u8 PY_mb_deng  []={"³ÎµÅµÆµÇµÈµÉµÊµËàâáØê­íãïëô£"};
const u8 PY_mb_di    []={"µÄµÖµ×µØµÙµÚµÛµÜµİµÌµÍµÎµÏµĞµÑµÒµÓµÔµÕµŞÌáØµÙáÚ®ÚĞÛ¡Ûæİ¶àÖæ·èÜé¦êëíÆíÚíûïáôÆ÷¾"};
const u8 PY_mb_dia   []={"àÇ"};
const u8 PY_mb_dian  []={"µçµêµëµãµäµåµìµíµîµßµàµáµâµæµèµéÚçÛãáÛçèîäñ°ñ²ô¡õÚ"};
const u8 PY_mb_diao  []={"µõµóµôµöµ÷µïµğµñµòîöï¢õõöô"};
const u8 PY_mb_die   []={"µøµùµúµûµüµıµşÛìÜ¦Şéà©ëºğ¬ñóõŞöø"};
const u8 PY_mb_ding  []={"¶¡¶¢¶£¶¤¶¥¶¦¶§¶¨¶©Øêà¤çàëëíÖî®îúğÛñôôú"};
const u8 PY_mb_diu   []={"¶ªîû"};
const u8 PY_mb_dong  []={"¶«¶¬¶­¶®¶¯¶°¶±¶²¶³¶´ßËá´á¼ë±ëËëØíÏğ´"};
const u8 PY_mb_dou   []={"¶¹¶º¶»¶¼¶µ¶¶¶·¶¸İúñ¼ò½óû"};
const u8 PY_mb_du    []={"¶Ç¶È¶É¶¼¶½¶¾¶¿¶À¶Á¶Â¶Ã¶Ä¶Å¶Æ¶ÊÜ¶à½äÂèüë¹ó¼óÆ÷Ç÷ò"};
const u8 PY_mb_duan  []={"¶Ë¶Ì¶Í¶Î¶Ï¶Ğé²ìÑóı"};
const u8 PY_mb_dui   []={"¶Ñ¶Ò¶Ó¶Ôí¡í­íÔ"};
const u8 PY_mb_dun   []={"¶Ü¶Õ¶Ö¶×¶Ø¶Ù¶Ú¶Û¶İãçìÀí»íâíïïæõ»"};
const u8 PY_mb_duo   []={"¶à¶ä¶È¶Ş¶ß¶á¶â¶ã¶å¶æ¶ç¶è¶éÍÔßÍßáãõç¶îìñÖõâ"};
const u8 PY_mb_e     []={"°¢¶ê¶ë¶ì¶í¶î¶ï¶ğ¶ñ¶ò¶ó¶ô¶õ¶öÅ¶Ø¬ÚÌÛÑÜÃİ­İàßÀãµåíæ¹éîëñï°ïÉğÊò¦öù"};
const u8 PY_mb_ei    []={"ÚÀ"};
const u8 PY_mb_en    []={"¶÷İìŞô"};
const u8 PY_mb_er    []={"¶ş¶ø¶ù¶ú¶û¶ü¶ı·¡åÇçíîïğ¹öÜ"};
const u8 PY_mb_fa    []={"·¢·£·¤·¥·¦·§·¨·©ÛÒíÀ"};
const u8 PY_mb_fan   []={"·²·³·´·µ·¶···¸·¹·º·ª·«·¬·­·®·¯·°·±Ş¬ŞÀá¦èóìÜî²õì"};
const u8 PY_mb_fang  []={"·»·¼·½·¾·¿·À·Á·Â·Ã·Ä·ÅØÎÚúèÊîÕô³öĞ"};
const u8 PY_mb_fei   []={"·Æ·Ç·È·É·Ê·Ë·Ì·Í·Î·Ï·Ğ·ÑÜÀáôì³ã­åúç³äÇé¼êÚëèìéíÉïĞğòòãóõôäö­öî"};
const u8 PY_mb_fen   []={"·Ö·Ò·Ü·İ·Ş·ß·à·Ó·Ô·Õ·×·Ø·Ù·Ú·ÛÙÇå¯çãèûêÚö÷÷÷"};
const u8 PY_mb_feng  []={"·á·â·ã·ä·å·æ·ç·ï·è·é·ê·ë·ì·í·îÙºÛºİ×ßôããí¿"};
const u8 PY_mb_fo    []={"·ğ"};
const u8 PY_mb_fou   []={"·ñó¾"};
const u8 PY_mb_fu    []={"¸´·ğ¸µ¸¶¸·¸¸·ò·ó·ô·õ¸¾·ö·÷·ø·ù·ú·û·ü·ı·ş¸¡¸¢¸£¸¤¸¥¸¦¸§¸¨¸©¸ª¸«¸¬¸­¸®¸¯¸°¸±¸²¸³¸¹¸º¸»¸¼¸½¸¿¸ÀÙëÙìÚâÛ®Ü½ÜÀÜŞÜòİ³İÊŞÔß»á¥âöäæåõæÚæâç¦ç¨èõêçìğíÉíêíëî·ïûğ¥ò¶òİòğòóôïõÃõÆöÖöû"};
const u8 PY_mb_ga    []={"¸Á¸Â¼Ğ¿§Ù¤ŞÎæØæÙê¸îÅ"};
const u8 PY_mb_gai   []={"¸Ã¸Ä¸Å¸Æ¸Ç¸È½æØ¤ÚëÛòê®êàëÜ"};
const u8 PY_mb_gan   []={"¸É¸Ê¸Ë¸Ì¸Í¸Î¸Ï¸Ğ¸Ñ¸Ò¸ÓÛáÜÕŞÏß¦ãïäÆä÷ç¤éÏêºí·ğáôû"};
const u8 PY_mb_gang  []={"¸Ô¸Õ¸Ö¸×¸Ø¸Ù¸Ú¸Û¸Ü¿¸í°î¸óà"};
const u8 PY_mb_gao   []={"¸æ¸Ş¸ß¸à¸İ¸á¸â¸ã¸ä¸åØºÚ¾Û¬Ş»çÉéÀéÂê½ï¯"};
const u8 PY_mb_ge    []={"¸ö¸÷¸Ç¸ç÷Àëõ¸è¸é¸ê¸ë¸ì¸í¸î¸ï¸ğ¸ñ¸ò¸ó¸ô¸õºÏ¿©ØªØîÛÁÛÙÜªàÃæüë¡îşïÓñËò´ô´"};
const u8 PY_mb_gei   []={"¸ø"};
const u8 PY_mb_gen   []={"¸ù¸úØ¨İ¢ßçôŞ"};
const u8 PY_mb_geng  []={"¸û¸ü¸ı¸ş¹¡¹¢¹£¾±ßìâÙç®öá"};
const u8 PY_mb_gong  []={"¹¤¹²¹¥¹¦¹§¹«¹¬¹­¹¨¹©¹ª¹®¹¯¹°¹±ò¼ŞÃçîëÅö¡"};
const u8 PY_mb_gou   []={"¹³¹´¹µ¹¶¹»¹¸¹¹¹ºØşÚ¸¹·óôá¸åÜæÅçÃèÛêíì°óÑ÷¸"};
const u8 PY_mb_gu    []={"¹Ã¹À¹Á¹Â¹½¹¾¹¼¹¿¹Ä¹Å¹Æ¹Ç¹È¹É¹Ê¹Ë¹Ì¹Í¼ÖØÅÚ¬İÔáÄãéèôéïêôêöëûì±î­î¹îÜïÀğ³ğÀğóòÁôşõıöñ÷½"};
const u8 PY_mb_gua   []={"¹Î¹Ï¹Ğ¹Ñ¹Ò¹ÓØÔÚ´ßÉèéëÒğ»"};
const u8 PY_mb_guai  []={"¹Ô¹Õ¹ÖŞâ"};
const u8 PY_mb_guan  []={"¹Ø¹Ù¹Ú¹Û¹Ü¹İ¹Ş¹ß¹à¹áÂÚÙÄİ¸¹×ŞèäÊîÂğÙ÷¤"};
const u8 PY_mb_guang []={"¹â¹ã¹äßÛáîèæë×"};
const u8 PY_mb_gui   []={"¹å¹æ¹ç¹è¹é¹ê¹ë¹ì¹í¹î¹ğ¹ñ¹ò¹ó¹ô¹ïÈ²ØĞØÛâÑå³æ£èíêÁêĞğ§óşöÙ÷¬"};
const u8 PY_mb_gun   []={"¹õ¹ö¹÷ÙòçµíŞöç"};
const u8 PY_mb_guo   []={"¹ø¹ù¹ú¹û¹ü¹ıÎĞÙåÛöŞâßÃàşáÆâ£é¤ë½ï¾ñøòäòå"};
const u8 PY_mb_ha    []={"¹ş¸òîş"};
const u8 PY_mb_hai   []={"»¹¿Èº¢º£º¦º¤º¥º§º¡àËëÜõ°"};
const u8 PY_mb_han   []={"º¹ººº°º®º¬º­º¯º±º¨ºµº¶º·º¸º©ºªº«º²º³÷ıº´ÚõİÕŞşå«êÏìÊñüò¥òÀ"};
const u8 PY_mb_hang  []={"ĞĞº»º¼º½¿ÔÏïãìç¬ñş"};
const u8 PY_mb_hao   []={"ºÂºÃºÄºÅê»ğ©ºÁºÆå°¸äº¾º¿ºÀºÑİïŞ¶àÆàãå©ò«òº"};
const u8 PY_mb_he    []={"ºÇºÈºÉºÊºËºÌºÍºÎºÏºÓºĞºÑºÒºÔºÕºØºÖº×ÏÅÚ­ÛÀÛÖàÀãØæüêÂîÁò¢òÂôç"};
const u8 PY_mb_hei   []={"ºÚºÙ"};
const u8 PY_mb_hen   []={"ºÛºÜºİºŞ"};
const u8 PY_mb_heng  []={"ºßºàºáºâºãŞ¿çñèì"};
const u8 PY_mb_hong  []={"ºìºäºåºæºçºèºéºêºëÙäÙêÚ§İ¦Ş®Ş°ãÈãü"};
const u8 PY_mb_hou   []={"ºóºíºîºïºğºñºòÜ©ááåËğúóóô×ö×÷¿"};
const u8 PY_mb_hu    []={"»¤»¥»¦»§ºËºôºõºöº÷ºøºùºúºû»¢ºüºıºş»¡»£Ùüßüàñá²â©âïã±ä°äïçúéÎéõì²ìÃìÎìæìèìïğ­ğÀğÉğ×ò®óËõ­õú÷½"};
const u8 PY_mb_hua   []={"»¨»ª»«»¬»©»­»®»¯»°æèèëí¹îü"};
const u8 PY_mb_huai  []={"»µ»±»²»³»´õ×"};
const u8 PY_mb_huan  []={"»¶»·»¸»¹»º»»»¼»½»¾»À»Á»Â»Ã÷ßä½»¿Û¨Û¼ÛùİÈß§à÷âµä¡äñå¾åÕçÙïÌöé"};
const u8 PY_mb_huang []={"»Î»Ä»Å»Æ»Ç»È»É»Ê»Ë»Ì»Í»Ï»Ğ»ÑÚòáåäÒäêåØè«ëÁñ¥ó¨óòöü"};
const u8 PY_mb_hui   []={"»á»Ø»Ù»Ú»Ò»Ó»Ô»Õ»Ö»×»Û»Ü»İ»Ş»ß»à»â»ã»ä»å»æåçÀ£Ú¶ÜîÜöŞ¥ßÔßÜà¹ãÄä§ä«çÀèíêÍí£ò³ó³÷â"};
const u8 PY_mb_hun   []={"»ç»è»é»ê»ë»ìÚ»âÆãÔäãçõ"};
const u8 PY_mb_huo   []={"ºÍ»í»î»ï»ğ»ñ»ò»ó»ô»õ»öØåŞ½ß«àëâ·îØïÁïìñëó¶"};
const u8 PY_mb_ji    []={"¼Æ¼Ç¸ø¼¼»÷»ù¼¸¼¹¼º»ø¼®¼¯¼°¼±¼²¼³¼´¼µ¼¶¼·¼»¼È¼É¼Ê¼½¼¾¼¿¼À¼Á»ú»û»ü»ı¼¡¼¢¼£¼¤¼¥¼¦¼§¼¨¼©¼ª¼«¼¬»ş¼­¼Â¼Ã¼Ä¼Å¼Ë¼Ì¼Í½åÆæÏµØ¢Ø½ØÀØŞÙ¥ÙÊÛÔÜ¸ÜÁÜùİ½İğŞªŞáß´ßÒßâßóá§áÕä©åæåìæ÷çÜçáé®éêêªê«êåêéê÷ì´í¶î¿ïúğ¢ñ¤ò±óÅóÇôßõÒõÕö«öİöê÷Ù÷ä"};
const u8 PY_mb_jia   []={"¼Ò¼Ó¼Î¼Ğ¼Ñ¼Ô¼Õ¼Ö¼×¼Ø¼Ù¼Ú¼Û¼Ü¼İ¼Ş¼ÏÇÑØÅÙ¤Û£İçáµä¤åÈçìê©ëÎí¢îòîşïØğèğıñÊòÌóÕôÂõÊ"};
const u8 PY_mb_jian  []={"½¨¼û¼ş¼ò½¡¼õ¼ß¼ö¼à¼ñ¼ó¼ô¼á¼â¼ä¼å¼æ¼ç¼è¼é¼ê¼ë¼ì¼í¼î¼ï¼ğ¼ã¼÷¼ø¼ù¼ú¼ü¼ı½¢½£½¤½¥½¦½§ÙÔÚÉÚÙÚÚİÑİóŞöàîäÕå¿åÀçÌèÅé¥ê§ê¯êğêùë¦ëìíúïµğÏñĞóÈôåõÂõİöä÷µ"};
const u8 PY_mb_jiang []={"½²ºç½©½ª½«½¬½­½®½¯½°½±½³½´½µÇ¿Üüä®ç­çÖêñíäñğôİôø"};
const u8 PY_mb_jiao  []={"½Ğ½Ï¾õ½ÇĞ£½¶½·½¸½¹½º½»½¼½½½¾½¿½À½Á½Â½Ã½Ä½Å½Æ½È½É½Ê½Ë½Ì½Í½Î½ÑÙ®ÙÕÜ´ÜúŞØàİá½áèæ¯ë¸ğ¨ğÔòÔõ´õÓöŞ"};
const u8 PY_mb_jie   []={"½à½á½â½ã½ä½Ò½Ü½Ó½Ô½ç½è½é½İ½Ş½Õ½Ö½×½Ø½Ù½Ú½Û½ß½å½æ½ê½ë½ìÙÊÚ¦ÚµÚàŞ×à®àµæ¼æİèîíÙïÇğÜò¡ò»ôÉöÚ÷º"};
const u8 PY_mb_jin   []={"½í¾¡½î½ï½ğ½ñ½ò½ô½õ½ö½÷½ø½ù½ú½û½ü½ı½ş¾¢½óÚáİ£İÀàäâËâÛæ¡çÆèªéÈêáêîîÄñÆñæ"};
const u8 PY_mb_jing  []={"¾©¾ª¾«¾­¾®¾¦¾§¾°¾»¾±¾²¾³¾´¾¯¾µ¾¶¾¹¾º¾¢¾£¾¤¾¥¾¨¾¬¾·¾¸ØÙÙÓÚåÚêİ¼â°ã½ãşåÉåòæºëÂëÖëæìºö¦"};
const u8 PY_mb_jiong []={"¾¼¾½ØçåÄìç"};
const u8 PY_mb_jiu   []={"¾Å¾Í¾È¾¾¾¿¾À¾Á¾Â¾Ã¾Ä¾Æ¾É¾Ê¾Ë¾Ì¾Î¾ÇÙÖà±ãÎèÑèêğ¯ğÕôñ÷İ"};
const u8 PY_mb_ju    []={"¾Ş¾ß¾à¾ã¾ä¾å³µ¹ñ¾ç¾Ó¾Ô¾Õ¾Ö¾×¾Ø¾Ù¾Ú¾Û¾Ü¾İ¾á¾â¾æ¾Ï¾Ğ¾Ñ¾ÒÙÆÚªÜÄÜÚÜìŞäåáåğè¢èÛé§é°é·éÙêøì«îÒï¸ñÀñÕôòõ¶õáö´öÂöÄ÷¶"};
const u8 PY_mb_juan  []={"¾ì¾í¾è¾é¾ê¾ë¾îÈ¦Û²áúä¸èğîÃïÃïÔöÁ"};
const u8 PY_mb_jue   []={"¾ö¾÷¾ø¾õ½Ç¾ò¾ó½À½Å¾ï¾ğ¾ñ¾ôØÊØãÚÜÛÇÜ¥Ş§àÙáÈâ±æŞçåèöéÓìßïãõêõû"};
const u8 PY_mb_jun   []={"¾ü¾ı¾ù¾ú¾û¾ş¿¡¿¢¿£¿¤¿¥¹êŞÜñäóŞ÷å"};
const u8 PY_mb_ka    []={"¿¨¿¦¿§¿©ØûßÇëÌ"};
const u8 PY_mb_kai   []={"¿ª¿«¿¬¿­¿®ØÜÛîİÜâéâıîøï´ïÇ"};
const u8 PY_mb_kan   []={"¿´¿¯¿°¿±¿²¿³Ù©íèî«ÛÉİ¨ãÛ¼÷ê¬"};
const u8 PY_mb_kang  []={"¿µ¿¶¿·¿¸¿¹¿º¿»ØøãÊîÖ"};
const u8 PY_mb_kao   []={"¿¼¿¿¿½¿¾èàêûîíåê"};
const u8 PY_mb_ke    []={"¿É¿Ê¿Ë¿Æ¿Ì¿Í¿Îà¾¿À¿Á¿Â¿Ã¿Ä¿Å¿Ç¿Èã¡òòá³äÛïıæìç¼çæéğë´î§îİîşºÇï¾ğâñ½ò¤òÂ÷Á"};
const u8 PY_mb_ken   []={"¿Ï¿Ğ¿Ñ¿ÒñÌ"};
const u8 PY_mb_keng  []={"¿Ó¿Ôï¬ëÖîï"};
const u8 PY_mb_kong  []={"¿Õ¿Ö¿×¿ØÙÅáÇóí"};
const u8 PY_mb_kou   []={"¿Ù¿Ú¿Û¿ÜÜÒŞ¢ßµíîóØ"};
const u8 PY_mb_ku    []={"¿İ¿Ş¿ß¿à¿á¿â¿ãç«÷¼ØÚÜ¥à·"};
const u8 PY_mb_kua   []={"¿ä¿å¿æ¿ç¿èÙ¨ï¾"};
const u8 PY_mb_kuai  []={"»á¿é¿ê¿ë¿ìØáÛ¦ßàáöëÚ"};
const u8 PY_mb_kuan  []={"¿í¿î÷Å"};
const u8 PY_mb_kuang []={"¿ö¿ï¿ğ¿ñ¿ò¿ó¿ô¿õÚ²Ú¿Ú÷ÛÛŞÅßÑæşêÜ"};
const u8 PY_mb_kui   []={"¿÷¿ø¿ù¿ú¿û¿ü¿ı¿şÀ¡À¢À£Ø¸ØÑåÓî¥õÍÙçÚóİŞŞñà­à°ã¦ã´êÒñùòñóñ"};
const u8 PY_mb_kun   []={"À¤À¥À¦À§ã§çûï¿õ«öïãÍ÷Õ"};
const u8 PY_mb_kuo   []={"À¨À©ÀªÀ«òÒ"};
const u8 PY_mb_la    []={"À¬À­À®À¯À°À±À²ÂäØİååê¹íÇğø"};
const u8 PY_mb_lai   []={"À³À´ÀµáÁáâäµäşêãíùñ®ô¥ïª"};
const u8 PY_mb_lan   []={"À¶À·À¸À¹ÀºÀ»À¼À½À¾À¿ÀÀÀÁÀÂÀÃÀÄá°äíé­ìµïçñÜî½"};
const u8 PY_mb_lang  []={"ÀÉÀÊÀËÀÅÀÆÀÇÀÈà¥ãÏòëï¶İõïüİ¹"};
const u8 PY_mb_lao   []={"ÀÌÀÍÀÎÀÏÀĞÀÑÀÒÀÓÀÔÂäÂçßëáÀõ²èáîîï©ğìñì"};
const u8 PY_mb_le    []={"ÀÕÀÖÁËØìß·ãî÷¦"};
const u8 PY_mb_lei   []={"ÀÛÀÕÀ×ÀØÀÙÀÚÀÜÀİÀŞÀßÀàÀáÙúÚ³àÏæĞçĞéÛñçõª"};
const u8 PY_mb_leng  []={"ÀâÀãÀäÜ¨ã¶"};
const u8 PY_mb_li    []={"ÀûÁ¦ÀúÀ÷Á¢Á£ÀñÁ¤ÀôÀíÀîÀïÀåÀøÀöÀæÀçÁ¥ÀèÀéÀëÀìÀğÀõÀùÀòÀóÀêÀüÀıÀşÁ¡Á§Á¨ØªÙ³ÙµÛªÛŞÜÂİ°İñŞ¼ß¿à¦à¬áûäàå¢åÎæ²æËæêçÊèÀèİéöìåíÂíÇîºî¾ï®ğ¿ğİğßòÃòÛó»óÒóöôÏõ·õÈö¨öâ÷¯÷ó"};
const u8 PY_mb_lia   []={"Á©"};
const u8 PY_mb_lian  []={"ÁªÁ«Á¬Á®Á¯Á°Á±Á²Á³Á´ÁµÁ¶Á·äòÁ­å¥çöé¬ŞÆéçİüì¡ñÍñÏó¹öã"};
const u8 PY_mb_liang []={"Á½ÁÁÁ©Á¸Á¹ÁºÁ»Á¼Á¾Á¿ÁÀÁÂÜ®İ¹é£õÔ÷Ë"};
const u8 PY_mb_liao  []={"ÁËÁÃÁÏÁÄÁÅÁÆÁÇÁÈÁÉÁÊÁÌÁÍÁÎŞ¤ŞÍàÚâ²å¼çÔîÉğÓ"};
const u8 PY_mb_lie   []={"ÁĞÁÑÁÒÁÓä£ÁÔÙıÛøŞæßÖôóõñ÷à"};
const u8 PY_mb_lin   []={"ÁÙÁÚÁŞÁàÁÕÁÖÁ×ÁØÁÛÁÜÁİÁßİşßøá×âŞãÁåàéİê¥ì¢î¬ôÔõï÷ë"};
const u8 PY_mb_ling  []={"ÁîÁéÁíÀâÁáÁâÁãÁäÁåÁæÁçÁèÁêÁëñöÁìÛ¹ÜßßÊàòãöç±èÚèùê²òÈôáöì"};
const u8 PY_mb_liu   []={"ÁõÁùÁïÁğÁñÁòÁóÁôÁöÁ÷ÁøÂµÂ½ä¯åŞæòç¸ì¼ìÖï³ïÖğÒöÌ"};
const u8 PY_mb_lo    []={"¿©"}; 
const u8 PY_mb_long  []={"ÁúÅªÁûÁüÁıÁşÂ¡Â¢Â£Â¤ÛâÜ×ãñççèĞëÊíÃñª"};
const u8 PY_mb_lou   []={"Â¥Â¦Â§Â¨Â©ÂªÂ¶ÙÍİäà¶áĞïÎğüñïò÷÷Ã"};
const u8 PY_mb_lu    []={"ÁùÂ«Â¬Â­Â®Â¯Â°Â±Â²Â³Â´ÂµÂ¶Â·Â¸Â¹ÂºÂ»Â¼Â½Â¾ÂÌÛäß£ààãòäËäõåÖè´èÓéÖéñéûê¤êÚëªëÍïåğµğØóüôµöÔ"};
const u8 PY_mb_lv    []={"ÂËÂÊÂÌÂÀÂÁÂÂÂÃÂÄÂÅÂÆÂÇÂÈÂÉÂ¿ñÚÙÍŞÛãÌéµëöïù"}; 
const u8 PY_mb_luan  []={"ÂÒÂÏÂÍÂÎÂĞÂÑ"};
const u8 PY_mb_lue   []={"ÂÓÂÔï²"};
const u8 PY_mb_lun   []={"ÂØÂÕÂÖÂ×ÂÙÂÚÂÛàğ"};
const u8 PY_mb_luo   []={"ÂäÂŞ¸õ¿©ÀÓÂÜÂİÂßÂàÂáÂâÂãÂåÂæÂçÙÀÙùÜıŞÛŞûâ¤ãøäğçóé¡ëáíÑïİñ§öÃ"};
const u8 PY_mb_m     []={"ß¼"};  
const u8 PY_mb_ma    []={"ÂèÂéÂêÂëÂìÂíÂîÂïÂğÄ¦Ä¨ßéáïæÖè¿ó¡"};
const u8 PY_mb_mai   []={"ÂñÂ÷ÂøÂùÂúÂûÂüÂıÂşÃ¡Ü¬á£çÏì×ïÜò©òı÷©÷´"};
const u8 PY_mb_man   []={"ÂùÂøÂ÷ÂúÂüÃ¡ÂıÂşÂû"};
const u8 PY_mb_mang  []={"Ã¢Ã£Ã¤Ã¥Ã¦Ã§ÚøäİíËòş"};
const u8 PY_mb_mao   []={"Ã¨Ã©ÃªÃ«Ã¬÷ÖÃ®Ã¯Ã°Ã±Ã²Ã³ÙóÃ­Üâá¹ã÷è£êÄêóë£ì¸í®î¦òúó±"};
const u8 PY_mb_me    []={"Ã´"};
const u8 PY_mb_mei   []={"Ã¿ÃÃÃÀÃµÃ¶ÃÁÃÂñÇ÷ÈÃ·Ã¸Ã¹ÃºÃ»Ã¼Ã½Ã¾ÃÄİ®áÒâ­ä¼äØé¹ïÑğÌ"};
const u8 PY_mb_men   []={"ÃÅÃÆÃÇŞÑìËí¯îÍ"};
const u8 PY_mb_meng  []={"ÃÈÃÎÃÉÃÊÃËÃÌÃÍÃÏÛÂİùŞ«ãÂëüíæòµòìó·ô»ô¿"};
const u8 PY_mb_mi    []={"ÃĞÃÑÃÒÃÓÃÔÃÕÃÖÃ×ÃØÃÙÃÚÃÛÃÜ÷çÚ×ÃİØÂÚ¢ŞÂßäà×â¨ãèåµåôæùëßìòôÍôé÷ã"};
const u8 PY_mb_mian  []={"ÃæÃŞÃßÃàÃáÃâÃãÃäÃåãæäÅäÏå²ëïíí"};
const u8 PY_mb_miao  []={"ÃçÃèÃéÃêÃëÃìÃíÃîß÷åãç¿çÑèÂíµíğğÅ"};
const u8 PY_mb_mie   []={"ÃïÃğØ¿ßãóúóº"};
const u8 PY_mb_min   []={"ÃñÃòÃóÃôÃõÃöÜåáºãÉãıçÅçäçëíªö¼÷ª"};
const u8 PY_mb_ming  []={"Ã÷ÃøÃùÃúÃûÃüÚ¤ÜøäéêÔî¨õ¤"};
const u8 PY_mb_miu   []={"ÃıçÑ"};
const u8 PY_mb_mo    []={"ÂöÃ»ÃşÄ¡Ä¢Ä£Ä¤Ä¥Ä¦Ä§Ä¨Ä©ÄªÄ«Ä¬Ä­Ä®Ä¯Ä°÷áÍòÚÓÜÔİëâÉæÆéâïÒï÷ñ¢ñòõöõø"};
const u8 PY_mb_mou   []={"Ä±Ä²Ä³Ù°ßèçÑíøòÖöÊ"};
const u8 PY_mb_mu    []={"Ä¾Ä¿ÄÀÄ£Ä²Ä´ÄµÄ¶Ä·Ä¸Ä¹ÄºÄ»Ä¼Ä½ÄÁÄÂÜÙãåØïÛéë¤îâ"};
const u8 PY_mb_na    []={"ÄÃÄÄÄÅÄÆÄÇÄÈÄÉŞàëÇïÕñÄ"};
const u8 PY_mb_nai   []={"ÄÊÄËÄÌÄÍÄÎØ¾Ù¦ÜµİÁèÍ"};
const u8 PY_mb_nan   []={"ÄÏÄĞÄÑà«àïéªëîòïôö"};
const u8 PY_mb_nang  []={"ÄÒàìâÎß­êÙ"};
const u8 PY_mb_nao   []={"ÄÓÄÔÄÕÄÖÄ×Ø«ÛñßÎâ®è§íĞîóòÍ"};
const u8 PY_mb_ne    []={"ÄÄÄØÚ«"};
const u8 PY_mb_nei   []={"ÄÚÄÙ"};
const u8 PY_mb_nen   []={"ÄÛí¥"};
const u8 PY_mb_neng  []={"ÄÜ"};
const u8 PY_mb_ng    []={"àÅ"}; 
const u8 PY_mb_ni    []={"ÄãÄØÄâÄáÄİÄŞÄßÄàÄäÄåÄæÄçÙ£Ûèâ¥âõêÇì»ìòí«íşîêöò"};
const u8 PY_mb_nian  []={"ÄèÄéÄêÄëÄìÄíÄîØ¥Ûşéığ¤öÓöó"};
const u8 PY_mb_niang []={"ÄïÄğ"};
const u8 PY_mb_niao  []={"ÄñÄòëåôÁÜàæÕ"};
const u8 PY_mb_nie   []={"ÄóÄôÄõÄöÄ÷ÄøÄùõæŞÁà¿Ø¿Úíò¨ô«"};
const u8 PY_mb_nin   []={"Äú"};
const u8 PY_mb_ning  []={"ÄûÄüÄıÄşÅ¡Å¢ØúßÌå¸ñ÷"};
const u8 PY_mb_niu   []={"Å£Å¤Å¥Å¦ŞÖæ¤áğâî"};
const u8 PY_mb_nong  []={"Å§Å¨Å©ÅªÙ¯ßæ"};
const u8 PY_mb_nou   []={"ññ"};
const u8 PY_mb_nu    []={"Å«Å¬Å­åóæÀæÛæå"};
const u8 PY_mb_nuan  []={"Å¯"};
const u8 PY_mb_nue   []={"Å±Å°"};
const u8 PY_mb_nuo   []={"ÄÈÅ²Å³Å´ÅµÙĞŞùßöï»"};
const u8 PY_mb_nv    []={"Å®í¤îÏô¬"};
const u8 PY_mb_o     []={"Å¶à¸àŞ"};
const u8 PY_mb_ou    []={"Å·Å¸Å¹ÅºÅ»Å¼Å½ÇøÚ©âæê±ñî"};
const u8 PY_mb_pa    []={"°Ç°ÒÅ¾Å¿ÅÀÅÁÅÂÅÃİâèËóá"};
const u8 PY_mb_pai   []={"ÅÄÅÅÅÆÅÇÅÈÅÉÆÈÙ½İåßß"};
const u8 PY_mb_pan   []={"·¬ÅÊÅËÅÌÅÍÅÎÅÏÅĞÅÑó´õçÅÖŞÕãÜãİãúêÚñÈñá"};
const u8 PY_mb_pang  []={"°ò°õ°÷ÅÒÅÓÅÔÅÕÅÖáİäèó¦åÌ"};
const u8 PY_mb_pao   []={"Å×ÅØÅÙÅÚÅÛÅÜÅİáóâÒğåëãŞË"};
const u8 PY_mb_pei   []={"ÅŞÅßÅàÅáÅâÅãÅäÅåÅæàÎö¬àúì·ïÂõ¬"};
const u8 PY_mb_pen   []={"ÅçÅèäÔ"};
const u8 PY_mb_peng  []={"ÅõÅöÅéÅêÅëÅìÅíÅîÅïÅğÅñÅòÅóÅôâñÜ¡àØó²"};
const u8 PY_mb_pi    []={"±Ù·ñÅ÷ÅøÅùÅúÅûÅüÅıÅşÆ¡Æ¢Æ£Æ¤Æ¥Æ¦Æ§Ø§Æ¨Æ©ñ±õùØòÚéÚğÚüÛ¯ÛÜÛıÜ±ÜÅß¨àèâÏäÄæÇç¢èÁê¶î¢î¼îëñÔñâò·òç"};
const u8 PY_mb_pian  []={"±â±ãÆªÆ«Æ¬Æ­ÚÒæéçÂêúëİôæõä"};
const u8 PY_mb_piao  []={"Æ®Æ¯Æ°Æ±ÆÓØâæÎçÎî©àÑæôéèóª"};
const u8 PY_mb_pie   []={"Æ²Æ³Ø¯ÜÖë­"};
const u8 PY_mb_pin   []={"Æ´ÆµÆ¶Æ·Æ¸æ°æÉé¯êòò­"};
const u8 PY_mb_ping  []={"·ëÆ¹ÆºÆ»Æ¼Æ½Æ¾Æ¿ÆÀÆÁÙ·æ³èÒöÒ"};
const u8 PY_mb_po    []={"²´·±ÆÂÆÃÆÄÆÅÆÆÆÇÆÈÆÉÆÓØÏÚéÛ¶çêê·ë¶îÇîŞğ«óÍ"};
const u8 PY_mb_pou   []={"ÆÊÙöŞå"};
const u8 PY_mb_pu    []={"ÆÕ±¤±©¸¬ÆËÆÌÆÍÆÎÆÏÆĞÆÑÆÒÆÓÆÔÆÖÆ×ÆØÆÙÙéàÛäßõëå§è±ë«ïäïè"};
const u8 PY_mb_qi    []={"ÆßÆğÆŞÆòÆóÆô»ü¼©ÆÚÆÛÆÜÆİÆàÆáÆâÆãÆäÆåÆæÆçÆèÆéÆêÆëÆìÆíáªÆîÆïÆñç÷çùè½ÆõÆöÆ÷ÆøÆùÆúÆûÆüÆıØ½ì÷í¬õè÷¢÷èØÁÙ¹ÛßÜ»ÜÎÜùİÂİİä¿æëç²êÈŞ­èçéÊì¥àÒá¨ãàíÓñıòÓòàôëôì"};
const u8 PY_mb_qia   []={"¿¨ÆşÇ¡Ç¢İÖñÊ÷Ä"};
const u8 PY_mb_qian  []={"Ç£Ç¤Ç¥Ç¦Ç§Ç¨Ç©ÇªÇ«Ç¬Ç­Ç®Ç¯Ç°Ç±Ç²Ç³Ç´ÇµÇ¶Ç·Ç¸ÏËÙ»ÙİÚäÜ·ÜÍÜçİ¡Şçá©ã¥ã»å¹åºå½ç×èıêùëÉí©îÔò¯óéôÇ"};
const u8 PY_mb_qiang []={"Ç¹ÇºÇ»Ç¼Ç½Ç¾Ç¿ÇÀõÄãŞê¨ìÁïÏïêãÜñßæÍéÉòŞôÇ"};
const u8 PY_mb_qiao  []={"¿ÇÇÁÇÂÇÃÇÄÇÅÇÆÇÇÇÈÇÉÇÊÇËÇÌÇÍÇÎÇÏÈ¸Ú½ÚÛÜñá½ã¾éÔõÎ÷³çØØäã¸íÍï¢"};
const u8 PY_mb_qie   []={"ÇĞÇÑÇÒÇÓÇÔÙ¤ã«ã»æªôòÛ§êüïÆóæ"};
const u8 PY_mb_qin   []={"ÇÕÇÖÇ×ÇØÇÙÇÚÇÛÇÜÇİÇŞÇßÜËŞìôÀßÄàºàßâÛéÕï·ñæñûòû"};
const u8 PY_mb_qing  []={"Ç×ÇàÇáÇâÇãÇäÇåÇæÇçÇèÇéÇêÇëÇìíàÜÜàõéÑïºòßóÀóäôìö¥öë÷ô"};
const u8 PY_mb_qiong []={"ÇíÇîñ·òËÚöÜäóÌõ¼öÆ"};
const u8 PY_mb_qiu   []={"³ğ¹êÇïÇğÇñÇòÇóÇôÇõÇöÙ´åÏôÃôÜåÙÛÏáìäĞé±êäò°òÇòøöú"};
const u8 PY_mb_qu    []={"Ç÷ÇøÇùÇúÇûÇüÇıÇşÈ¡È¢È£È¤È¥òĞ÷ñĞçÚ°Û¾ÛÉÜÄŞ¡Ş¾á«áéãÖè³êïë¬ëÔìîíáğ¶ñ³ó½ôğöÄ"};
const u8 PY_mb_quan  []={"È¦È§È¨È©ÈªÈ«È¬È­È®È¯È°Ú¹Üõòé÷Üáëãªç¹éúî°îıóÜ"};
const u8 PY_mb_que   []={"È±È²È³È´ÈµÈ¶È·È¸ã×ãÚí¨"};
const u8 PY_mb_qui   []={"÷ü"};  
const u8 PY_mb_qun   []={"È¹ÈºåÒ÷å"};
const u8 PY_mb_ran   []={"È»È¼È½È¾ÜÛòÅ÷×"};
const u8 PY_mb_rang  []={"È¿ÈÀÈÁÈÂÈÃìüğ¦"};
const u8 PY_mb_rao   []={"ÈÄÈÅÈÆÜéæ¬èã"};
const u8 PY_mb_re    []={"ÈÇÈÈßö"};
const u8 PY_mb_ren   []={"ÈÉÈÊÈËÈÌÈÍÈÎÈÏÈĞÈÑÈÒïşØéØğÜóİØâ¿éíñÅ"};
const u8 PY_mb_reng  []={"ÈÓÈÔ"};
const u8 PY_mb_ri    []={"ÈÕ"};
const u8 PY_mb_rong  []={"ÈÖÈ×ÈØÈÙÈÚÈÛÈÜÈİÈŞÈßáÉáõéÅëÀòî"};
const u8 PY_mb_rou   []={"ÈàÈáÈâôÛõå÷·"};
const u8 PY_mb_ru    []={"ÈãÈäÈåÈæÈçÈèÈéÈêÈëå¦ÈìäáİêàéŞ¸ä²çÈï¨ñàò¬"};
const u8 PY_mb_ruan  []={"ÈíÈîëÃ"};
const u8 PY_mb_rui   []={"ÈïÈğÈñÜÇî£èÄŞ¨ò¸"};
const u8 PY_mb_run   []={"ÈòÈó"};
const u8 PY_mb_ruo   []={"ÈôÈõÙ¼óè"};
const u8 PY_mb_sa    []={"ÈöÈ÷ÈøØ¦ØíìªëÛ"};
const u8 PY_mb_sai   []={"ÈùÈúÈûÈüàç"};
const u8 PY_mb_san   []={"ÈıÈşÉ¡É¢âÌë§ôÖ"};
const u8 PY_mb_sang  []={"É£É¤É¥Şúíßòª"};
const u8 PY_mb_sao   []={"É¦É§É¨É©ëığşÜ£çÒöş"};
const u8 PY_mb_se    []={"ÈûÉªÉ«É¬ØÄï¤ğ£"};
const u8 PY_mb_sen   []={"É­"};
const u8 PY_mb_seng  []={"É®"};
const u8 PY_mb_sha   []={"É¯É°É±É²É³É´ÉµÉ¶É·É¼ÏÃğğôÄö®öèßşì¦ï¡"};
const u8 PY_mb_shai  []={"É«É¸É¹"};
const u8 PY_mb_shan  []={"²ôµ¥ÉºÉ»É¼É½É¾É¿ÉÀÉÁÉÂÉÃÉÄÉÅÉÆÉÇÉÈÉÉÕ¤Ú¨ğŞô®óµõÇ÷­ØßÛ·ÛïÜÏáêäúæ©æÓæóëşìøîÌ÷Ô"};
const u8 PY_mb_shang []={"ÉÊÉËÉÌÉÍÉÎÉÏÉĞÉÑç´éäõüÛğìØ"};
const u8 PY_mb_shao  []={"ÇÊÉÒÉÓÉÔÉÕÉÖÉ×ÉØÉÙÉÚÉÛÉÜÛ¿Üæô¹äûè¼òÙóâ"};
const u8 PY_mb_she   []={"ÉİÉŞÉßÉàÉáÉâÉãÉäÉåÉæÉçÉè÷êÕÛØÇÙÜŞéâ¦äÜì¨î´îè"};
const u8 PY_mb_shei  []={"Ë­"}; 
const u8 PY_mb_shen  []={"Ê²²ÎÉéÉêÉëÉìÉíÉîÉïÉğÉñÉòÉóÉôÉõÉöÉ÷ÉøÚ·ÚÅİ·İØßÓäÉé©ëÏïòò×"};
const u8 PY_mb_sheng []={"³ËÉùÉúÉûÉüÉıÉşÊ¡Ê¢Ê£Ê¤Ê¥óÏáÓäÅêÉíò"};
const u8 PY_mb_shi   []={"ÊÇÊÂ³×Ê¦Ê®Ê¯Ê§Ê¨Ê©ÊªÊ«Ê¬Ê­Ê°Ê±Ê²Ê³Ê´ÊµÊ¶Ê·Ê¸Ê¹ÊºÊ»Ê¼Ê½Ê¾Ê¿ÊÀÊÁÊÃÊÄÊÅÊÆÊÈÊÉÊÊÊËÊÌÊÍÊÎÊÏÊĞÊÑÊÒÊÓÊÔËÆß±óÂÖ³ÖÅÚÖÛõİªİéâ»éøêÛìÂìêîæîèó§óßõ§õ¹öåöõ"};
const u8 PY_mb_shou  []={"ÊÕÊÖÊ×ÊØÊÙÊÚÊÛÊÜÊİÊŞŞĞá÷ç·ô¼"};
const u8 PY_mb_shu   []={"ÊßÊàÊáÊâÊãÊäÊåÊæÊçÊèÊéÊêÊëÊìÊíÊîÊïÊğÊñÊòÊóÊôÊõÊöÊ÷ÊøÊùÊúÊûÊüÊıÊşË¡Ù¿ÛÓãğäøæ­Ø­İÄŞóç£ë¨ëòì¯ïíïøñâ"};
const u8 PY_mb_shua  []={"Ë¢Ë£à§"};
const u8 PY_mb_shuai []={"ÂÊË¤Ë¥Ë¦Ë§ó°"};
const u8 PY_mb_shuan []={"Ë¨Ë©ãÅäÌ"};
const u8 PY_mb_shuang[]={"ËªË«Ë¬ãñæ×"};
const u8 PY_mb_shui  []={"Ë®Ë¯Ë°Ëµãß"};
const u8 PY_mb_shun  []={"Ë±Ë²Ë³Ë´"};
const u8 PY_mb_shuo  []={"ÊıËµË¶Ë·Ë¸İôŞ÷åùéÃîå"};
const u8 PY_mb_si    []={"Ë¹ËºË»Ë¼Ë½Ë¾Ë¿ËÀËÁËÂËÃËÄËÅËÆËÇËÈØËßĞÙ¹ÙîÛÌâ»ãáãôäùæ¦æáçÁìëïÈğ¸ñêòÏóÓ"};
const u8 PY_mb_song  []={"ËÉËÊËËËÌËÍËÎËÏËĞáÔâìã¤äÁñµáÂİ¿Ú¡"};
const u8 PY_mb_sou   []={"ËÑËÒËÓËÔÛÅà²âÈäÑì¬î¤ïËòôàÕŞ´"};
const u8 PY_mb_su    []={"ËÕËÖË×ËØËÙËÚËÛËÜËİËŞËßËàËõÙíãºä³óùöÕÚÕİøà¼ö¢"};
const u8 PY_mb_suan  []={"ËáËâËãâ¡"};
const u8 PY_mb_sui   []={"ËäËêËçËåËæËèËîËìËéËíËë"};
const u8 PY_mb_sun   []={"ËïËğËñ"};
const u8 PY_mb_suo   []={"ËòËóËôËõËöË÷ËøËùßïàÂàÊæ¶É¯èøêıíüôÈ"};
const u8 PY_mb_ta    []={"ËúËûËüËıËşÌ¡Ì¢í³Ì£Ì¤ÍØãËåİé½îèõÁäâ÷£äğ"};
const u8 PY_mb_tai   []={"Ì¥Ì¦Ì§Ì¨Ì©ÌªÌ«Ì¬Ì­õÌÛ¢Ş·ææëÄìÆîÑöØ"};
const u8 PY_mb_tan   []={"µ¯Ì®Ì¯Ì°Ì±Ì²Ì³Ì´ÌµÌ¶Ì·Ì¸Ì¹ÌºÌ»Ì¼Ì½Ì¾Ì¿ñûÛ°å£ê¼êæìşîãïÄïâ"};
const u8 PY_mb_tang  []={"ÌÀÌÁÌÂÌÃÌÄÌÅÌÆÌÇÌÈÌÉÌÊÌËÌÌÙÎâ¼äçè©éÌîõó«ï¦ïÛñíó¥ôÊõ±àû"};
const u8 PY_mb_tao   []={"ÌÍÌÎÌÏÌĞÌÑÌÒÌÓÌÔÌÕÌÖÌ×ß¶ßû÷Òä¬èºìâØ»"};
const u8 PY_mb_te    []={"ÌØß¯ìıï«"};
const u8 PY_mb_teng  []={"ÌÙÌÚÌÛëøÌÜ"};
const u8 PY_mb_ti    []={"ÌİÌŞÌßÌàÌáÌâÌãÌäÌåÌæÌçÌèÌéÌêÌëÙÃã©ç¾ÜèåÑç°ğÃñÓõ®"};
const u8 PY_mb_tian  []={"ÌìÌíÌîÌïÌğÌñÌòÌóéåŞİãÃãÙî±îäï»"};
const u8 PY_mb_tiao  []={"µ÷ÌôÌõÌöÌ÷ÌøÙ¬÷ØÜæìöï¢ñ»òèóÔôĞö¶öæ"};
const u8 PY_mb_tie   []={"ÌùÌúÌû÷Ñï°İÆ"};
const u8 PY_mb_ting  []={"ÌüÌıÌşÍ¡Í¢Í£Í¤Í¥Í¦Í§ÜğİãæÃîúòÑöªèè"};
const u8 PY_mb_tong  []={"Í©Í«Í¬Í­Í®Í¯Í°Í±Í²Í³Í´Ù¡Ù×ÜíâúäüÍªÙÚÛíàÌá¼íÅ"};
const u8 PY_mb_tou   []={"ÍµÍ¶Í·Í¸÷»î×Ùï"};
const u8 PY_mb_tu    []={"Í¹ÍºÍ»Í¼Í½Í¾Í¿ÍÀÍÁÍÂÍÃÜ¢İ±İËîÊõ©"};
const u8 PY_mb_tuan  []={"ÍÄÍÅŞÒåèî¶"};
const u8 PY_mb_tui   []={"ÍÆÍÇÍÈÍÉÍÊÍËìÕ"};
const u8 PY_mb_tun   []={"¶ÚÍÊÍÌÍÍÍÎâ½ëàÙÛêÕ"};
const u8 PY_mb_tuo   []={"ËµÍÏÍØÍĞÍÑÍÒÍÓÍÔÍÕÍÖÍ×ÍÙõÉØ±Ù¢ÛçãûèØèŞéÒíÈîèö¾óêõ¢âÕ"};
const u8 PY_mb_wa    []={"ÍÚÍÛÍÜÍİÍŞÍßÍàØôæ´ëğ"};
const u8 PY_mb_wai   []={"ÍáÍâáË"};
const u8 PY_mb_wan   []={"ÂûÍãÍäÍåÍæÍçÍèÍéÍêÍëÍìÍíÍîÍïÍğÍñÍòÍóØàÜ¹İ¸İÒæıòêçºçşëäîµ÷´"};
const u8 PY_mb_wang  []={"ÍôÍõÍöÍ÷ÍøÍùÍúÍûÍüÍıØèã¯÷ÍŞÌéş"};
const u8 PY_mb_wei   []={"ÎªÎ»Î½ÍşÎ¡Î¢Î£Î¤Î¬Î¥Î¦Î§Î¨Î©Î«Î­Î®Î¯Î°Î±Î²Î³Î´ÎµÎ¶Î·Î¸Î¹ÎºÎ¼Î¾Î¿ÎÀÙËÚÃÚóÛ×İÚŞ±àøá¡áËáÍâ¬åÔæ¸ğôì¿çâãÇâ«Úñãíä¢ä¶è¸ê¦ìĞôºöÛàí"};
const u8 PY_mb_wen   []={"ÎÊÎÄÎÅÎÆÎÁÎÂÎÃÎÇÎÈÎÉØØö©çäãÓãëè·"};
const u8 PY_mb_weng  []={"ÎËÎÌÎÍİîŞ³"};
const u8 PY_mb_wo    []={"ÎÒÎÕà¸ÎÏÎĞÎÑÎÓÎÔÎÖÎÎÙÁİ«á¢ö»ä×ë¿íÒ"};
const u8 PY_mb_wu    []={"ÎåÎïÎğÎñÎçÎèÎéÎäÎê¶ñÎòÎóØ£Î×ÎíÎØÎÙÎÚÎÛÎÜÎİÎŞÎßÎàÎáÎâÎãÎæÎëÎìÎîØõÚùğÄÛØÜÌßíâĞâäâèğÍğíòÚä´å»åÃåüæÄæğÚãè»êõì¶ìÉöÈ÷ù"};
const u8 PY_mb_xi    []={"Ï£Ï°Ï¦Ï·Ï¸ÎôÎõÎöÎ÷ÎøÎùÎúÎûÎüÎıÎşÏ¡õèÏ¢Ï¤Ï¥Ï§Ï¨ÏªÏ«Ï¬Ï®Ï¯Ï±Ï²Ï´ÏµÏ¶ôËğªåïæÒçôéØŞÉÜçÏ­Ï©Ï³ØÎÙÒÙâÚôÛ­İ¾İßİûßñáãâ¾ãÒä»äÀêØêêì¤ì¨ìäìùìûñ¶ñÓòáó£ó¬ôªô¸ôÑôâõµ÷û"};
const u8 PY_mb_xia   []={"Ï¹ÏºÏ»Ï¼Ï½Ï¾Ï¿ÏÀÏÁÏÂÏÃÏÄÏÅßÈáòåÚè¦èÔíÌóÁ÷ï"};
const u8 PY_mb_xian  []={"ÏÖÏÈÏÉÏÓÏÔÏÕÏ×ÏØÏÍÏ³Ï´ÏÆÏÇÏÊÏËÏÌÏÎÏÏÏĞÏÑÏÒÏÙÏÚÏÛÏÜÏİÏŞÏßÙşÜÈİ²Şºá­áıåßæµë¯ìŞììğÂğçğïò¹óÚôÌõ£õĞõÑö±"};
const u8 PY_mb_xiang []={"ÏñÏòÏó½µÏàÏáÏâÏãÏäÏæÏçÏèÏéÏêÏëÏìÏíÏîÏïÏğÏå÷ÏÜ¼İÙâÃâÔæøç½ó­öß"};
const u8 PY_mb_xiao  []={"Ğ¡ÏûĞ¤ÏôÏõÏöÏ÷ÏøÏùÏúÏüÏıÏşĞ¢Ğ£Ğ¥Ğ¦Ğ§ßØäìåĞóãóïæçç¯èÉèÕòÙ÷Ì"};
const u8 PY_mb_xie   []={"Ğ©ĞªĞ«Ğ¬Ğ­Ğ®Ğ¯Ğ°Ğ±Ğ²Ğ³Ğ´ĞµĞ¶Ğ·Ğ¸Ğ¹ĞºĞ»Ğ¼Ñª½âĞ¨Ò¶ÙÉÙôÛÄÛÆŞ¯ß¢â³âİäÍå¬åâç¥çÓé¿éÇò¡õóöÙ÷º"};
const u8 PY_mb_xin   []={"Ğ½Ğ¾Ğ¿ĞÀĞÁĞÂĞÃĞÄĞÅĞÆÜ°İ·ì§öÎê¿Ø¶âàïâ"};
const u8 PY_mb_xing  []={"ĞÒÊ¡ĞÇĞÈĞÉĞÊĞËĞÌĞÍĞÎĞÏĞĞĞÑĞÓĞÔĞÕâ¼ÚêÜôÜşß©ã¬íÊ"};
const u8 PY_mb_xiong []={"ĞÖĞ×ĞØĞÙĞÚĞÛĞÜÜº"};
const u8 PY_mb_xiu   []={"³ôËŞĞİĞŞĞßĞàĞáĞâĞãĞäĞåßİäåõ÷âÊá¶âÓğ¼÷Û"};
const u8 PY_mb_xu    []={"ĞøĞ÷ĞæĞçĞèĞéĞêĞëĞìĞíĞîĞïĞğĞñĞòĞóĞôĞõĞöÚ¼ìãÛÃÛ×Ş£äªä°äÓçïèòÓõñãíìôÚõ¯"};
const u8 PY_mb_xuan  []={"ĞşÑ¡ĞùĞúĞûäÖĞüĞıêÑÑ¤ìÅÑ£Ñ¢ÙØÚÎİæãùäöè¯é¸ìÓŞïíÛîçïàÈ¯"};
const u8 PY_mb_xue   []={"Ï÷Ñ¥Ñ¦Ñ§Ñ¨Ñ©Ñª÷¨ÚÊàåí´õ½"};
const u8 PY_mb_xun   []={"Ñ°Ñ®Ñ¸Ñ¶Ñ¯ÑµÑ«Ñ¬Ñ­Ñ±Ñ²Ñ³Ñ´Ñ·Û¨Û÷Ü÷Ş¹á¾áßõ¸öà¿£İ¡Ş¦â´Ùãâşä­ä±êÖñ¿"};
const u8 PY_mb_ya    []={"ÑÀÑ¿ÑÇÑÆÑ¹ÑÅÑºÑ»Ñ¼Ñ½Ñ¾ÑÂÑÃÑÄÑÈÔşØóÑÁÛëŞëá¬åÂæ«çğèâë²í¼íığéñâ"};
const u8 PY_mb_yan   []={"ÑÔÑİÑéÑáÑÏÑØÑ×ÑàÑÊÑËÑÙÑÚÑÛÑÌÑÍÑÎÑĞÑÒÑÓÑÕÑÖÑÜÑŞÑßÑâÑãÑäÑÉÑåÑæÑçÑèÑÑãÆåûæÌëÙëçìÍâûÙ²ÙÈÇ¦ÒóØÉØÍØßÙğÚ¥ÚİÚçÛ±Û³Ü¾İÎáÃ÷ÊãÕäÎäÙçüéÜêÌî»óÛõ¦÷Ğ÷ú÷ü"};
const u8 PY_mb_yang  []={"ÑëÑöÑòÑóÑôÑøÑùÑîÑïí¦ÑêÑìÑíÑğÑõÑñÑ÷Ñúáàâóãóì¾ìÈòÕ÷±"};
const u8 PY_mb_yao   []={"ÒªÑûÒ§Ò©ÑüÑıÒ¡Ò¢ëÈñºÒ£Ò¤Ò¥Ò¦Ò¨Ò«Ô¿Ø²Ø³çÛßºÑşÄöÅ±½ÄáÅáÊáæçòèÃé÷ê×ï¢ğÎôí÷¥"};
const u8 PY_mb_ye    []={"Ò²Ò³ÒµÒ¶Ò¹ÒºÒ¬Ò­Ò®Ò¯Ò°Ò±Ò´Ò·Ò¸Ğ°ÑÊÚËÖÑØÌÚşŞŞçğêÊìÇîô"};
const u8 PY_mb_yi    []={"Ò»ÒÒÒÑÒÔÒäÒåÒéÒêÒëÒìÒæÒ¼Ò½Ò¾Ò¿ÒÀÒÁÒÂÒÃÒÄÒÅÒÆÒÇÒÈÒÉÒÊÒËÒÌÒÍÒÎÒÏÒĞÒÓÒÕÒÖÒ×ÒØÒÙÒÚÒÛÒÜÒİÒŞÒßÒàÒáÒâÒãÒçÒèÒíÒî°¬Î²ÒïØ×ØæØıÙ«Ú±ÚâÛİÛüÜ²ÜÓÜèŞ²ŞÄŞÈŞÚß®ß½ß×ßŞàæá»áÚâ¢âÂâøâùã¨äôåÆæäçËéìéóêİì¥ì½ìÚíôîÆîèï×ïîğêğùñ¯ñ´ñÂòæô¯ôàôèôı÷ğ"};
const u8 PY_mb_yin   []={"ÒüÒıÓ¡ÒğÒñÒòÒóÒôÒõÒöÒ÷ÒøÒùÒúÒûÒşö¸Ø·ò¾Û´ÛÈÛóÜ§ÜáßÅà³áşâ¹ä¦äÎë³î÷ñ«ñ¿ö¯"};
const u8 PY_mb_ying  []={"Ó³Ó°Ó¢Ó¨Ó©ÓªÓ«Ó£Ó¤Ó¥Ó¦Ó§Ó¬Ó­Ó®Ó¯Ó±Ó²ÙøİºİÓğĞäëå­äŞçøÛ«ÜãÜşİöŞüàÓâßè¬éºëôñ¨ò£ó¿"};
const u8 PY_mb_yo    []={"Ó´Óıà¡"};
const u8 PY_mb_yong  []={"ÓÃÓµÓ¶ÓÂÓ¿Ó·Ó¸Ó¹ÓºÓ»Ó¼Ó½Ó¾ÓÀÓÁÙ¸ÛÕÜ­à¯ã¼çßïŞğ®÷«÷Ó"};
const u8 PY_mb_you   []={"ÓÈÓĞÓÖÓÕÓ×ÓÑÓÒÓÓÓÄÓÅÓÆÓÇÓÉÓÊÓËÓÌÓÍÓÎÓÏÓÔßÏğàöÏ÷î÷øòÄØüØÕÙ§İ¬İ¯İµŞÌàóå¶èÖéàë»îğòÊòöòøôí"};
const u8 PY_mb_yu    []={"ÓàÓëÓÚÓèÓîÓñÓêÓıÓşÔ¡ÓãÓØÓÙÓÛÓİÓŞÓßÓáÓâÓäÓåÓæÓçÓéÓìÓíÓïÓğÓòÓóÓôÓõÓöÓ÷ÓøÓùÓúÓÜÓûÓüÔ¢Ô£Ô¤Ô¥Ô¦óÄØ¹ÚÄì¶ÚÍÎµÎ¾Ø®ØñÙ¶İÇİÒİ÷ŞíàôàöáÎáüâÀâÅâ×ãĞå÷åıæ¥æúè¤êÅêìëéì£ìÏìÙìÛí±í²îÚğÁğÖğõğöñ¾ñÁòâòõô§ô¨ö§ö¹"};
const u8 PY_mb_yuan  []={"Ô­ÔªÔ°Ô±Ô²Ô´ÔµÔ¶Ô¸Ô¹ÔºÔ§Ô¨Ô©Ô«Ô¬Ô®Ô¯Ô³Ô·æÂÜ«Ü¾Şòà÷ãäè¥éÚë¼íóğ°ó¢óîö½"};
const u8 PY_mb_yue   []={"ÔÂÔÃÔÄÀÖËµÔ»Ô¼Ô½Ô¾Ô¿ÔÀÔÁÙßßÜå®èİéĞë¾îá"};
const u8 PY_mb_yun   []={"ÔÆÔ±ÔÊÔËÔÎÔÅÔÈÔÉÔÌÔÍìÙÔÏÔĞëµéæÜ¿ÔÇÛ©áñã¢ã³ç¡è¹êÀóŞ"};
const u8 PY_mb_za    []={"ÔÑÔÒÔÓÔúÕ¦ßÆŞÙ"};
const u8 PY_mb_zai   []={"ÔÙÔÚÔÔÔÕÔÖÔ×ÔØáÌçŞ"};
const u8 PY_mb_zan   []={"ÔÛÔÜÔİÔŞêÃô¢ŞÙè¶ôØôõöÉ"};
const u8 PY_mb_zang  []={"²ØÔßÔàÔáæàê°"};
const u8 PY_mb_zao   []={"ÔæÔâÔçÔìÔíÔîÔãÔäÔèÔêÔëÔïÔåÔéßğ"};
const u8 PY_mb_ze    []={"ÔğÔñÔòÔóÕ¦ØÆØÓßõàıåÅê¾óĞóåô·"};
const u8 PY_mb_zei   []={"Ôô"};
const u8 PY_mb_zen   []={"ÔõÚÚ"};
const u8 PY_mb_zeng  []={"ÔöÔ÷ÔøÔùçÕêµîÀï­"};
const u8 PY_mb_zha   []={"ÔúÕ¢²éÔûÔüÔıÔşÕ¡Õ£Õ¤Õ¥Õ¦Õ§Õ¨Õ©ß¸ßå×õŞêòÆßîà©é«íÄğäö´÷ş"};
const u8 PY_mb_zhai  []={"Õ¬Õ­Õ®µÔÔñÕªÕ«Õ¯íÎñ©"};
const u8 PY_mb_zhan  []={"Õ¼Õ½Õ¾Õ¹Õ´ÕÀÕ°Õ±Õ²Õ³ÕµÕ¶Õ·Õ¸Õº²üÕ»Õ¿ÚŞŞøæöì¹"};
const u8 PY_mb_zhang []={"ÕÅÕÉÕÌÕÍÕÈÕÁÕÂÕÃÕÄÕÆÕÇÕÊÕË³¤ÕÎÕÏá¤áÖâ¯ó¯ØëÛµæÑè°"};
const u8 PY_mb_zhao  []={"ÕÒÕÙ×¦×ÅÕ×³¯ÕĞÕÑÚ¯ÕÓÕÔÕÕÕÖÕØîÈóÉßúèş"};
const u8 PY_mb_zhe   []={"ÕÚÕÛÕÜÕİÕŞÕßÕàÕáÕâÕã×ÅÚØß¡èÏéüíİğÑñŞòØô÷"};
const u8 PY_mb_zhen  []={"ÕæÕêÕëÕğÕñÕïÕóÕòÕìÕíÕäÕîÕåÕçóğÕéÖ¡ÛÚÕèİèä¥äÚçÇèåé©é»éôêâëÓëŞìõî³ğ¡ğ²"};
const u8 PY_mb_zheng []={"ÕıÖ¤ÕôÕõÕöÕ÷ÕøÕùÕúÕûÕüÕşÖ¢Ö£Úºá¿áçîÛï£óİöë"};
const u8 PY_mb_zhi   []={"Ö»Ö°Ê¶Ö´ÖµÖ±Ö²Ö³ÖÎÖ§Ö½Ö¾Ö·Ö¸ÖÊÖÃÖÆÖ¹ÖÁÖ¶Ö¥Ö®Ö­Ö¼Ö¦ÖªÖ«Ö¬Ö¯ÖºÖ¿ÖÀÖÂÖÄÖÅÖÇÖÈÖÉÖ¨Ö©ÖËÖÌÖÍÖÏè×ÜÆØ´ÚìÛ¤ÛúŞıàùáçâºâååéåëæïèÎèÙèäéòéùêŞëÕëùìíìóíéïôğºğëòÎôêõ¥õÅõÙõÜõôö£"};
const u8 PY_mb_zhong []={"ÖĞÖÚÖÒÖÓÖÔÖÕÖÖÖ×ÖØÖÙÖÑÚ£âìïñó®ô±õà"};
const u8 PY_mb_zhou  []={"ÖÛÖÜÖİÖŞÖßÖàÖáÖâÖãÖäÖåÖæÖçÖèİ§ßúæ¨æûç§ëĞíØô¦ôíôü"};
const u8 PY_mb_zhu   []={"Ö÷×¡×¢×£ÖñÖéÖêÖëÖìÖíÖîÖïÖğÖòÖóÖôÖõÖöÖøÖùÖúÖûÖüÖıÖş×¤ØùóÃóçÙªÊôÊõÛ¥ÜÑÜïä¨ä¾äóèÌéÆéÍìÄîùğæğññÒô¶ôãõî÷æØ¼"};
const u8 PY_mb_zhua  []={"×¥×¦ÎÎ"};
const u8 PY_mb_zhuai []={"×§×ª"};
const u8 PY_mb_zhuan []={"´«×¨×©×ª×«×¬×­ßùâÍãçò§"};
const u8 PY_mb_zhuang[]={"´±×®×¯×°×±×²×³×´ŞÊí°"};
const u8 PY_mb_zhui  []={"×µ×¶×·×¸×¹×ºã·æíçÄö¿"};
const u8 PY_mb_zhun  []={"×»×¼â½ëÆñ¸"};
const u8 PY_mb_zhuo  []={"×Å×½×¾×¿×À×Æ×Â×Ç×Ã×Á×ÄÙ¾ÚÂßªä·äÃåªìÌìúí½ïí"};
const u8 PY_mb_zi    []={"×Ô×Ó×Ö×Ğ×È×É×Ê×Ë×Ì×Í×Î×Ï×Ñ×Ò×Õö·æ¢Ö¨áÑÚÑÜëæÜç»è÷ê¢êßí§íöïÅïöñèóÊôÒôôõşö¤öö÷Ú"};
const u8 PY_mb_zong  []={"×Ú×Û×Ü×××Ø×Ù×İôÕÙÌèÈëê"};
const u8 PY_mb_zou   []={"×ß×à×á×ŞÚÁÚîÛ¸æãöí"};
const u8 PY_mb_zu    []={"×ã×é×ä×å×â×æ×ç×èÙŞİÏïß"};
const u8 PY_mb_zuan  []={"×êß¬×ëçÚõò"};
const u8 PY_mb_zui   []={"×î×ï×ì×íŞ©õş"};
const u8 PY_mb_zun   []={"×ğ×ñé×÷®ß¤"};
const u8 PY_mb_zuo   []={"×ó×ô×ö×÷×ø×ù×ò´éßò×õÚè×ÁàÜâôëÑìñíÄõ¡"};

//Æ´ÒôË÷Òı±í
const py_index py_index3[]=
{
{"" ,"",(u8*)PY_mb_space},
{"2","a",(u8*)PY_mb_a},
{"3","e",(u8*)PY_mb_e},
{"6","o",(u8*)PY_mb_o},
{"24","ai",(u8*)PY_mb_ai},
{"26","an",(u8*)PY_mb_an},
{"26","ao",(u8*)PY_mb_ao},
{"22","ba",(u8*)PY_mb_ba},
{"24","bi",(u8*)PY_mb_bi},
{"26","bo",(u8*)PY_mb_bo},
{"28","bu",(u8*)PY_mb_bu},
{"22","ca",(u8*)PY_mb_ca},
{"23","ce",(u8*)PY_mb_ce},
{"24","ci",(u8*)PY_mb_ci},
{"28","cu",(u8*)PY_mb_cu},
{"32","da",(u8*)PY_mb_da},
{"33","de",(u8*)PY_mb_de},
{"34","di",(u8*)PY_mb_di},
{"38","du",(u8*)PY_mb_du},
{"36","en",(u8*)PY_mb_en},
{"37","er",(u8*)PY_mb_er},
{"32","fa",(u8*)PY_mb_fa},
{"36","fo",(u8*)PY_mb_fo},
{"38","fu",(u8*)PY_mb_fu},
{"42","ha",(u8*)PY_mb_ha},
{"42","ga",(u8*)PY_mb_ga},
{"43","ge",(u8*)PY_mb_ge},
{"43","he",(u8*)PY_mb_he},
{"48","gu",(u8*)PY_mb_gu},
{"48","hu",(u8*)PY_mb_hu},
{"54","ji",(u8*)PY_mb_ji},
{"58","ju",(u8*)PY_mb_ju},
{"52","ka",(u8*)PY_mb_ka},
{"53","ke",(u8*)PY_mb_ke},
{"58","ku",(u8*)PY_mb_ku},
{"52","la",(u8*)PY_mb_la},
{"53","le",(u8*)PY_mb_le},
{"54","li",(u8*)PY_mb_li},
{"58","lu",(u8*)PY_mb_lu},
{"58","lv",(u8*)PY_mb_lv},
{"62","ma",(u8*)PY_mb_ma},
{"63","me",(u8*)PY_mb_me},
{"64","mi",(u8*)PY_mb_mi},
{"66","mo",(u8*)PY_mb_mo},
{"68","mu",(u8*)PY_mb_mu},
{"62","na",(u8*)PY_mb_na},
{"63","ne",(u8*)PY_mb_ne},
{"64","ni",(u8*)PY_mb_ni},
{"68","nu",(u8*)PY_mb_nu},
{"68","nv",(u8*)PY_mb_nv},
{"68","ou",(u8*)PY_mb_ou},
{"72","pa",(u8*)PY_mb_pa},
{"74","pi",(u8*)PY_mb_pi},
{"76","po",(u8*)PY_mb_po},
{"78","pu",(u8*)PY_mb_pu},
{"74","qi",(u8*)PY_mb_qi},
{"78","qu",(u8*)PY_mb_qu},
{"73","re",(u8*)PY_mb_re},
{"74","ri",(u8*)PY_mb_ri},
{"78","ru",(u8*)PY_mb_ru},
{"72","sa",(u8*)PY_mb_sa},
{"73","se",(u8*)PY_mb_se},
{"74","si",(u8*)PY_mb_si},
{"78","su",(u8*)PY_mb_su},
{"82","ta",(u8*)PY_mb_ta},
{"83","te",(u8*)PY_mb_te},
{"84","ti",(u8*)PY_mb_ti},
{"88","tu",(u8*)PY_mb_tu},
{"92","wa",(u8*)PY_mb_wa},
{"96","wo",(u8*)PY_mb_wo},
{"98","wu",(u8*)PY_mb_wu},
{"94","xi",(u8*)PY_mb_xi},
{"98","xu",(u8*)PY_mb_xu},
{"92","ya",(u8*)PY_mb_ya},
{"93","ye",(u8*)PY_mb_ye},
{"94","yi",(u8*)PY_mb_yi},
{"96","yo",(u8*)PY_mb_yo},
{"98","yu",(u8*)PY_mb_yu},
{"92","za",(u8*)PY_mb_za},
{"93","ze",(u8*)PY_mb_ze},
{"94","zi",(u8*)PY_mb_zi},
{"98","zu",(u8*)PY_mb_zu},
{"264","ang",(u8*)PY_mb_ang},
{"224","bai",(u8*)PY_mb_bai},
{"226","ban",(u8*)PY_mb_ban},
{"226","bao",(u8*)PY_mb_bao},
{"234","bei",(u8*)PY_mb_bei},
{"236","ben",(u8*)PY_mb_ben},
{"243","bie",(u8*)PY_mb_bie},
{"246","bin",(u8*)PY_mb_bin},
{"224","cai",(u8*)PY_mb_cai},
{"226","can",(u8*)PY_mb_can},
{"226","cao",(u8*)PY_mb_cao},
{"242","cha",(u8*)PY_mb_cha},
{"243","che",(u8*)PY_mb_che},
{"244","chi",(u8*)PY_mb_chi},
{"248","chu",(u8*)PY_mb_chu},
{"268","cou",(u8*)PY_mb_cou},
{"284","cui",(u8*)PY_mb_cui},
{"286","cun",(u8*)PY_mb_cun},
{"286","cuo",(u8*)PY_mb_cuo},
{"324","dai",(u8*)PY_mb_dai},
{"326","dan",(u8*)PY_mb_dan},
{"326","dao",(u8*)PY_mb_dao},
{"334","dei",(u8*)PY_mb_dei},
{"343","die",(u8*)PY_mb_die},
{"348","diu",(u8*)PY_mb_diu},
{"368","dou",(u8*)PY_mb_dou},
{"384","dui",(u8*)PY_mb_dui},
{"386","dun",(u8*)PY_mb_dun},
{"386","duo",(u8*)PY_mb_duo},								
{"326","fan",(u8*)PY_mb_fan},
{"334","fei",(u8*)PY_mb_fei},
{"336","fen",(u8*)PY_mb_fen},
{"368","fou",(u8*)PY_mb_fou},
{"424","gai",(u8*)PY_mb_gai},
{"426","gan",(u8*)PY_mb_gan},
{"426","gao",(u8*)PY_mb_gao},
{"434","gei",(u8*)PY_mb_gei},
{"436","gen",(u8*)PY_mb_gan},
{"468","gou",(u8*)PY_mb_gou},
{"482","gua",(u8*)PY_mb_gua},
{"484","gui",(u8*)PY_mb_gui},
{"486","gun",(u8*)PY_mb_gun},
{"486","guo",(u8*)PY_mb_guo},
{"424","hai",(u8*)PY_mb_hai},
{"426","han",(u8*)PY_mb_han},
{"426","hao",(u8*)PY_mb_hao},
{"434","hei",(u8*)PY_mb_hei},
{"436","hen",(u8*)PY_mb_hen},
{"468","hou",(u8*)PY_mb_hou},
{"482","hua",(u8*)PY_mb_hua},
{"484","hui",(u8*)PY_mb_hui},
{"486","hun",(u8*)PY_mb_hun},
{"486","huo",(u8*)PY_mb_huo},
{"542","jia",(u8*)PY_mb_jia},
{"543","jie",(u8*)PY_mb_jie},
{"546","jin",(u8*)PY_mb_jin},
{"548","jiu",(u8*)PY_mb_jiu},
{"583","jue",(u8*)PY_mb_jue},
{"586","jun",(u8*)PY_mb_jun},
{"524","kai",(u8*)PY_mb_kai},
{"526","kan",(u8*)PY_mb_kan},
{"526","kao",(u8*)PY_mb_kao},
{"536","ken",(u8*)PY_mb_ken},
{"568","kou",(u8*)PY_mb_kou},
{"582","kua",(u8*)PY_mb_kua},
{"584","kui",(u8*)PY_mb_kui},
{"586","kun",(u8*)PY_mb_kun},
{"586","kuo",(u8*)PY_mb_kuo},
{"524","lai",(u8*)PY_mb_lai},
{"526","lan",(u8*)PY_mb_lan},
{"526","lao",(u8*)PY_mb_lao},
{"534","lei",(u8*)PY_mb_lei},
{"543","lie",(u8*)PY_mb_lie},
{"546","lin",(u8*)PY_mb_lin},
{"548","liu",(u8*)PY_mb_liu},
{"568","lou",(u8*)PY_mb_lou},
{"583","lue",(u8*)PY_mb_lue},
{"586","lun",(u8*)PY_mb_lun},
{"586","luo",(u8*)PY_mb_luo},
{"624","mai",(u8*)PY_mb_mai},
{"626","man",(u8*)PY_mb_man},
{"626","mao",(u8*)PY_mb_mao},
{"634","mei",(u8*)PY_mb_mei},
{"636","men",(u8*)PY_mb_men},
{"643","mie",(u8*)PY_mb_mie},
{"646","min",(u8*)PY_mb_min},
{"648","miu",(u8*)PY_mb_miu},
{"668","mou",(u8*)PY_mb_mou},
{"624","nai",(u8*)PY_mb_nai},
{"626","nan",(u8*)PY_mb_nan},
{"626","nao",(u8*)PY_mb_nao},
{"634","nei",(u8*)PY_mb_nei},
{"636","nen",(u8*)PY_mb_nen},
{"643","nie",(u8*)PY_mb_nie},
{"646","nin",(u8*)PY_mb_nin},
{"648","niu",(u8*)PY_mb_niu},
{"683","nue",(u8*)PY_mb_nue},
{"686","nuo",(u8*)PY_mb_nuo},
{"724","pai",(u8*)PY_mb_pai},
{"726","pan",(u8*)PY_mb_pan},
{"726","pao",(u8*)PY_mb_pao},
{"734","pei",(u8*)PY_mb_pei},
{"736","pen",(u8*)PY_mb_pen},
{"743","pie",(u8*)PY_mb_pie},
{"746","pin",(u8*)PY_mb_pin},
{"768","pou",(u8*)PY_mb_pou},
{"742","qia",(u8*)PY_mb_qia},
{"743","qie",(u8*)PY_mb_qie},
{"746","qin",(u8*)PY_mb_qin},
{"748","qiu",(u8*)PY_mb_qiu},
{"783","que",(u8*)PY_mb_que},
{"786","qun",(u8*)PY_mb_qun},
{"726","ran",(u8*)PY_mb_ran},
{"726","rao",(u8*)PY_mb_rao},
{"736","ren",(u8*)PY_mb_ren},
{"768","rou",(u8*)PY_mb_rou},
{"784","rui",(u8*)PY_mb_rui},
{"786","run",(u8*)PY_mb_run},
{"786","ruo",(u8*)PY_mb_ruo},
{"724","sai",(u8*)PY_mb_sai},
{"726","sao",(u8*)PY_mb_sao},
{"726","san",(u8*)PY_mb_san},
{"736","sen",(u8*)PY_mb_sen},
{"742","sha",(u8*)PY_mb_sha},
{"743","she",(u8*)PY_mb_she},
{"744","shi",(u8*)PY_mb_shi},
{"748","shu",(u8*)PY_mb_shu},
{"768","sou",(u8*)PY_mb_sou},
{"784","sui",(u8*)PY_mb_sui},
{"786","sun",(u8*)PY_mb_sun},
{"786","suo",(u8*)PY_mb_suo},
{"824","tai",(u8*)PY_mb_tai},
{"826","tan",(u8*)PY_mb_tan},
{"826","tao",(u8*)PY_mb_tao},
{"843","tie",(u8*)PY_mb_tie},
{"868","tou",(u8*)PY_mb_tou},
{"884","tui",(u8*)PY_mb_tui},
{"886","tun",(u8*)PY_mb_tun},
{"886","tuo",(u8*)PY_mb_tuo},
{"924","wai",(u8*)PY_mb_wai},
{"926","wan",(u8*)PY_mb_wan},
{"934","wei",(u8*)PY_mb_wei},
{"936","wen",(u8*)PY_mb_wen},
{"942","xia",(u8*)PY_mb_xia},
{"943","xie",(u8*)PY_mb_xie},
{"946","xin",(u8*)PY_mb_xin},
{"948","xiu",(u8*)PY_mb_xiu},
{"983","xue",(u8*)PY_mb_xue},
{"986","xun",(u8*)PY_mb_xun},
{"926","yan",(u8*)PY_mb_yan},
{"926","yao",(u8*)PY_mb_yao},
{"946","yin",(u8*)PY_mb_yin},
{"968","you",(u8*)PY_mb_you},
{"983","yue",(u8*)PY_mb_yue},
{"986","yun",(u8*)PY_mb_yun},
{"924","zai",(u8*)PY_mb_zai},
{"926","zan",(u8*)PY_mb_zan},
{"926","zao",(u8*)PY_mb_zao},
{"934","zei",(u8*)PY_mb_zei},
{"936","zen",(u8*)PY_mb_zen},
{"942","zha",(u8*)PY_mb_zha},
{"943","zhe",(u8*)PY_mb_zhe},
{"944","zhi",(u8*)PY_mb_zhi},
{"948","zhu",(u8*)PY_mb_zhu},
{"968","zou",(u8*)PY_mb_zou},
{"984","zui",(u8*)PY_mb_zui},
{"986","zun",(u8*)PY_mb_zun},
{"986","zuo",(u8*)PY_mb_zuo},
{"2264","bang",(u8*)PY_mb_bang},
{"2364","beng",(u8*)PY_mb_beng},
{"2426","bian",(u8*)PY_mb_bian},
{"2426","biao",(u8*)PY_mb_biao},
{"2464","bing",(u8*)PY_mb_bing},
{"2264","cang",(u8*)PY_mb_cang},
{"2364","ceng",(u8*)PY_mb_ceng},
{"2424","chai",(u8*)PY_mb_chai},
{"2426","chan",(u8*)PY_mb_chan},
{"2426","chao",(u8*)PY_mb_chao},
{"2436","chen",(u8*)PY_mb_chen},
{"2468","chou",(u8*)PY_mb_chou},
{"2484","chuai",(u8*)PY_mb_chuai},
{"2484","chui",(u8*)PY_mb_chui},
{"2486","chun",(u8*)PY_mb_chun},
{"2486","chuo",(u8*)PY_mb_chuo},
{"2664","cong",(u8*)PY_mb_cong},
{"2826","cuan",(u8*)PY_mb_cuan},
{"3264","dang",(u8*)PY_mb_dang},
{"3364","deng",(u8*)PY_mb_deng},
{"3426","dian",(u8*)PY_mb_dian},
{"3426","diao",(u8*)PY_mb_diao},
{"3464","ding",(u8*)PY_mb_ding},
{"3664","dong",(u8*)PY_mb_dong},
{"3826","duan",(u8*)PY_mb_duan},
{"3264","fang",(u8*)PY_mb_fang},
{"3364","feng",(u8*)PY_mb_feng},
{"4264","gang",(u8*)PY_mb_gang},
{"4364","geng",(u8*)PY_mb_geng},
{"4664","gong",(u8*)PY_mb_gong},
{"4824","guai",(u8*)PY_mb_guai},
{"4826","guan",(u8*)PY_mb_guan},
{"4264","hang",(u8*)PY_mb_hang},
{"4364","heng",(u8*)PY_mb_heng},
{"4664","hong",(u8*)PY_mb_hong},
{"4823","huai",(u8*)PY_mb_huai},
{"4826","huan",(u8*)PY_mb_huan},
{"5426","jian",(u8*)PY_mb_jian},
{"5426","jiao",(u8*)PY_mb_jiao},
{"5464","jing",(u8*)PY_mb_jing},
{"5826","juan",(u8*)PY_mb_juan},
{"5264","kang",(u8*)PY_mb_kang},
{"5364","keng",(u8*)PY_mb_keng},
{"5664","kong",(u8*)PY_mb_kong},
{"5824","kuai",(u8*)PY_mb_kuai},
{"5826","kuan",(u8*)PY_mb_kuan},
{"5264","lang",(u8*)PY_mb_lang},
{"5366","leng",(u8*)PY_mb_leng},
{"5426","lian",(u8*)PY_mb_lian},
{"5426","liao",(u8*)PY_mb_liao},
{"5464","ling",(u8*)PY_mb_ling},
{"5664","long",(u8*)PY_mb_long},
{"5826","luan",(u8*)PY_mb_luan},
{"6264","mang",(u8*)PY_mb_mang},
{"6364","meng",(u8*)PY_mb_meng},
{"6426","mian",(u8*)PY_mb_mian},
{"6426","miao",(u8*)PY_mb_miao},
{"6464","ming",(u8*)PY_mb_ming},
{"6264","nang",(u8*)PY_mb_nang},
{"6364","neng",(u8*)PY_mb_neng},
{"6426","nian",(u8*)PY_mb_nian},
{"6426","niao",(u8*)PY_mb_niao},
{"6464","ning",(u8*)PY_mb_ning},
{"6664","nong",(u8*)PY_mb_nong},
{"6826","nuan",(u8*)PY_mb_nuan},
{"7264","pang",(u8*)PY_mb_pang},
{"7364","peng",(u8*)PY_mb_peng},
{"7426","pian",(u8*)PY_mb_pian},
{"7426","piao",(u8*)PY_mb_piao},
{"7464","ping",(u8*)PY_mb_ping},
{"7426","qian",(u8*)PY_mb_qian},
{"7426","qiao",(u8*)PY_mb_qiao},
{"7464","qing",(u8*)PY_mb_qing},
{"7826","quan",(u8*)PY_mb_quan},
{"7264","rang",(u8*)PY_mb_rang},
{"7364","reng",(u8*)PY_mb_reng},
{"7664","rong",(u8*)PY_mb_rong},
{"7826","ruan",(u8*)PY_mb_ruan},
{"7264","sang",(u8*)PY_mb_sang},
{"7364","seng",(u8*)PY_mb_seng},
{"7424","shai",(u8*)PY_mb_shai},
{"7426","shan",(u8*)PY_mb_shan},
{"7426","shao",(u8*)PY_mb_shao},
{"7434","shei",(u8*)PY_mb_shei},
{"7436","shen",(u8*)PY_mb_shen},    
{"7468","shou",(u8*)PY_mb_shou},
{"7482","shua",(u8*)PY_mb_shua},
{"7484","shui",(u8*)PY_mb_shui},
{"7486","shun",(u8*)PY_mb_shun},
{"7486","shuo",(u8*)PY_mb_shuo},
{"7664","song",(u8*)PY_mb_song},
{"7826","suan",(u8*)PY_mb_suan},
{"8264","tang",(u8*)PY_mb_tang},
{"8364","teng",(u8*)PY_mb_teng},
{"8426","tian",(u8*)PY_mb_tian},
{"8426","tiao",(u8*)PY_mb_tiao},
{"8464","ting",(u8*)PY_mb_ting},
{"8664","tong",(u8*)PY_mb_tong},
{"8826","tuan",(u8*)PY_mb_tuan},
{"9264","wang",(u8*)PY_mb_wang},
{"9364","weng",(u8*)PY_mb_weng},
{"9426","xian",(u8*)PY_mb_xian},
{"9426","xiao",(u8*)PY_mb_xiao},
{"9464","xing",(u8*)PY_mb_xing},
{"9826","xuan",(u8*)PY_mb_xuan},
{"9264","yang",(u8*)PY_mb_yang},
{"9464","ying",(u8*)PY_mb_ying},
{"9664","yong",(u8*)PY_mb_yong},
{"9826","yuan",(u8*)PY_mb_yuan},
{"9264","zang",(u8*)PY_mb_zang},
{"9364","zeng",(u8*)PY_mb_zeng},
{"9424","zhai",(u8*)PY_mb_zhai},
{"9426","zhan",(u8*)PY_mb_zhan},
{"9426","zhao",(u8*)PY_mb_zhao},
{"9436","zhen",(u8*)PY_mb_zhen},
{"9468","zhou",(u8*)PY_mb_zhou},
{"9482","zhua",(u8*)PY_mb_zhua},
{"9484","zhui",(u8*)PY_mb_zhui},
{"9486","zhun",(u8*)PY_mb_zhun},
{"9486","zhuo",(u8*)PY_mb_zhuo},
{"9664","zong",(u8*)PY_mb_zong},
{"9826","zuan",(u8*)PY_mb_zuan},
{"24264","chang",(u8*)PY_mb_chang},
{"24364","cheng",(u8*)PY_mb_cheng},
{"24664","chong",(u8*)PY_mb_chong},
{"24826","chuan",(u8*)PY_mb_chuan},
{"48264","guang",(u8*)PY_mb_guang},
{"48264","huang",(u8*)PY_mb_huang},
{"54264","jiang",(u8*)PY_mb_jiang},
{"54664","jiong",(u8*)PY_mb_jiong},
{"58264","kuang",(u8*)PY_mb_kuang},
{"54264","liang",(u8*)PY_mb_liang},
{"64264","niang",(u8*)PY_mb_niang},
{"74264","qiang",(u8*)PY_mb_qiang},
{"74664","qiong",(u8*)PY_mb_qiong},
{"74264","shang ",(u8*)PY_mb_shang},
{"74364","sheng",(u8*)PY_mb_sheng},
{"74824","shuai",(u8*)PY_mb_shuai},
{"74826","shuan",(u8*)PY_mb_shuan},
{"94264","xiang",(u8*)PY_mb_xiang},
{"94664","xiong",(u8*)PY_mb_xiong},
{"94264","zhang",(u8*)PY_mb_zhang},
{"94364","zheng",(u8*)PY_mb_zheng},
{"94664","zhong",(u8*)PY_mb_zhong},
{"94824","zhuai",(u8*)PY_mb_zhuai},
{"94826","zhuan",(u8*)PY_mb_zhuan},
{"248264","chuang",(u8*)PY_mb_chuang},
{"748264","shuang",(u8*)PY_mb_shuang},
{"948264","zhuang",(u8*)PY_mb_zhuang},
};

#endif
